{
  "featured": [
    {
      "id": "psych-ward-optimization",
      "title": "psych ward room optimization",
      "category": "analytics",
      "year": "2025",
      "summary": "inpatient psych ward space optimization with linear programming",
      "full_description": "Inpatient psych ward space optimization using linear programming",
      "tech": [
        "python",
        "pulp",
        "matplotlib",
        "seaborn",
        "pandas"
      ],
      "github_url": "https://github.com/Glenn-Harless/Psych-Ward-Room-Optimization",
      "is_private": false,
      "highlight": "Presented at APA Conference",
      "expanded_content": {
        "problem": "optimizing room assignments in a 26-bed psychiatric facility while balancing patient acuity levels, staff resources, and safety constraints",
        "approach": "linear programming with pulp library. modeled complex constraints including patients deemed unsafe for others or themselves requiring their own room, other patients could double in a room",
        "results": "achieved 99.99% bed utilization efficiency through optimal configuration of 10 single rooms and 8 double rooms (vs current all-double configuration), reducing bed waste from 52 to just 2 beds over 4-month test period while maintaining patient safety requirements",
        "impact": "presented at apa conference. adopted by original facilities. demonstrates practical application of operations research in healthcare"
      }
    },
    {
      "id": "geo-causal-inference",
      "title": "geo causal inference",
      "category": "research",
      "year": "2025",
      "summary": "measuring causal effects of marketing interventions with time-based regression (tbr) with matched...",
      "full_description": "Measuring causal effects of marketing interventions using Time-Based Regression (TBR) with Matched Markets methodology",
      "tech": [
        "jupyter notebook",
        "python"
      ],
      "github_url": "https://github.com/Glenn-Harless/geo-causal-inference",
      "is_private": false,
      "expanded_content": {
        "problem": "measuring true causal effects of marketing interventions when randomized direct experiments aren't feasible",
        "approach": "time-based regression with matched markets methodology. leverages geographic variation as natural experiments",
        "results": "identified promising geo regions for TV ad implementation and enabled confident impact assessment",
        "impact": "enables data-driven marketing decisions with rigorous statistical backing"
      }
    },
    {
      "id": "signal-23-ai",
      "title": "signal 23.ai",
      "category": "ai-ml",
      "year": "2024",
      "summary": "building rag system on top of notion documentation for signal 23 artist",
      "full_description": "Building RAG system on top of Notion documentation for signal 23 artist",
      "tech": [
        "python",
        "rag",
        "notion api",
        "faiss/pgvector",
        "fastapi"
      ],
      "github_url": "https://github.com/Glenn-Harless/signal-23.ai",
      "is_private": false,
      "highlight": "AI/LLM powered",
      "expanded_content": {
        "problem": "artist's notion documentation scattered across multiple sources. fans needed unified knowledge interface",
        "approach": "rag system with faiss/pgvector for semantic search. custom cyberpunk ui matching artist aesthetic",
        "results": "95% relevance accuracy on test queries. created eerie artifact communicating in broken language for atmospheric effect",
        "impact": "enhances fan engagement through ai-powered knowledge discovery"
      }
    },
    {
      "id": "content-pulse",
      "title": "content pulse",
      "category": "ai-ml",
      "year": "2024",
      "summary": "llm-powered content aggregator and analyzer for extracting real-time insights from social media a...",
      "full_description": "LLM-powered content aggregator and analyzer for extracting real-time insights from social media and news sources",
      "tech": [
        "python",
        "fastapi",
        "beautifulsoup4",
        "uvicorn",
        "ollama"
      ],
      "github_url": "https://github.com/Glenn-Harless/content-pulse",
      "is_private": false,
      "expanded_content": {
        "problem": "crypto market moves faster than human analysis can track. signal often buried in social media noise",
        "approach": "real-time ingestion from multiple sources. llm-powered sentiment extraction and trend identification",
        "results": "personal tool for scraping multiple news outlets in the morning",
        "impact": "provides traders with early market intelligence through automated analysis"
      }
    },
    {
      "id": "econdash",
      "title": "econdash",
      "category": "engineering",
      "year": "2024",
      "summary": "airflow and postgresql data pipeline for bea economic data",
      "full_description": "Airflow and PostgreSQL data pipeline for BEA economic data",
      "tech": [
        "python",
        "apache airflow",
        "postgresql",
        "docker",
        "redis"
      ],
      "github_url": "https://github.com/Glenn-Harless/EconDash",
      "is_private": false,
      "expanded_content": {
        "problem": "economic data scattered across federal agencies. manual collection error-prone and time-consuming",
        "approach": "airflow orchestration with bea api integration. postgresql storage with dbt transformations",
        "results": "automated daily updates of 50+ economic indicators. 99.9% pipeline reliability",
        "impact": "enables real-time economic analysis with production-grade infrastructure"
      }
    },
    {
      "id": "ethoscope",
      "title": "ethoscope",
      "category": "engineering",
      "year": "2025",
      "summary": "comprehensive ethereum network monitoring platform tracking gas prices, mev activity, and l2 migr...",
      "full_description": "Comprehensive Ethereum network monitoring platform tracking gas prices, MEV activity, and L2 migration patterns with real-time ETL pipeline and predictive analytics",
      "tech": [
        "python",
        "fastapi",
        "timescaledb",
        "prophet",
        "scikit-learn"
      ],
      "github_url": "https://github.com/Glenn-Harless/ethoscope",
      "is_private": false,
      "expanded_content": {
        "problem": "ethereum network health monitoring requires real-time analysis of gas prices, mev activity, and l2 migration patterns across fragmented data sources",
        "approach": "real-time etl pipeline with web3.py and alchemy api. timescaledb for efficient time-series storage. prophet and scikit-learn for predictive analytics",
        "results": "automated collection of blockchain metrics with reliable data ingestion. comprehensive historical data storage for trend analysis",
        "impact": "personal tool for understanding ethereum metrics and gaining hands-on experience in the web3 space"
      }
    },
    {
      "id": "ope-base",
      "title": "ope base",
      "category": "analytics",
      "year": "2024",
      "summary": "analytics platform for tracking music artist engagement across twitter, instagram, and reddit. im...",
      "full_description": "Analytics platform for tracking music artist engagement across Twitter, Instagram, and Reddit. Implements bot detection with Isolation Forest, clustering for user segmentation, and trend analysis to optimize content strategy",
      "tech": [
        "jupyter notebook",
        "python",
        "docker",
        "postgresql",
        "metabase"
      ],
      "github_url": "https://github.com/Glenn-Harless/ope_base",
      "is_private": false,
      "expanded_content": {
        "problem": "music artists lack data-driven insights for content strategy. engagement patterns obscured by bots and noise",
        "approach": "multi-year social media tracking with ml analysis. isolation forest for bot detection, clustering for audience segmentation",
        "results": "identified optimal posting times, content types, and audience segments. detected 15-20% bot activity in engagement metrics",
        "impact": "enabled data-driven content strategy for independent artists. insights applicable across music industry"
      }
    },
    {
      "id": "arcope-website",
      "title": "arcope website",
      "category": "web",
      "year": "2025",
      "summary": "interactive website for solo electronic project arcope featuring network/data aesthetics inspired...",
      "full_description": "Interactive website for solo electronic project Arcope featuring network/data aesthetics inspired by Odesza",
      "tech": [
        "typescript",
        "react",
        "framer motion",
        "vite",
        "tailwind css"
      ],
      "github_url": "https://github.com/Glenn-Harless/arcope-website",
      "is_private": false,
      "highlight": "Live at arcope.xyz",
      "expanded_content": {
        "problem": "solo electronic music project needed web presence reflecting odesza-inspired sound and data/network aesthetics",
        "approach": "react with framer motion animations. vibe-coded frontend exploring creative web development outside backend comfort zone",
        "results": "interactive site with network-inspired visuals matching the musical aesthetic. deployed on netlify with docker dev environment",
        "impact": "demonstrates versatility beyond backend/data work. shows willingness to learn and experiment with new domains"
      },
      "live_url": "http://arcope.xyz/"
    },
    {
      "id": "lost-in-tropez-website",
      "title": "lost in tropez website",
      "category": "web",
      "year": "2025",
      "summary": "vibrant website for electronic dance duo lost in tropez with retro psychedelic aesthetics inspire...",
      "full_description": "Vibrant website for electronic dance duo Lost in Tropez with retro psychedelic aesthetics inspired by Polo & Pan",
      "tech": [
        "typescript",
        "react",
        "vite",
        "tailwind css",
        "docker"
      ],
      "github_url": "https://github.com/Glenn-Harless/lost-in-tropez-website",
      "is_private": false,
      "highlight": "Live at lostintropez.xyz",
      "expanded_content": {
        "problem": "electronic dance duo inspired by polo & pan needed vibrant web presence with retro psychedelic aesthetics",
        "approach": "typescript react with vite build system. embraced experimental frontend development to match group's playful energy",
        "results": "colorful, animated site capturing the duo's tropical electronic vibe. containerized development for consistent environments",
        "impact": "showcases creative side and ability to translate musical aesthetics into visual web experiences"
      },
      "live_url": "https://lostintropez.xyz/"
    },
    {
      "id": "signal-23-website",
      "title": "signal 23 website",
      "category": "web",
      "year": "2025",
      "summary": "interactive website for electronic duo signal-23 featuring dystopian noise effects and data/numbe...",
      "full_description": "Interactive website for electronic duo Signal-23 featuring dystopian noise effects and data/numbers station aesthetics",
      "tech": [
        "react",
        "javascript",
        "webpack",
        "tailwind css",
        "docker"
      ],
      "github_url": "https://github.com/Glenn-Harless/signal-23-website",
      "is_private": false,
      "highlight": "Live at signal23.net",
      "expanded_content": {
        "problem": "electronic duo exploring moderat-inspired themes needed dystopian web presence reflecting data/numbers station aesthetics",
        "approach": "react with interactive noise effects and signal animations. webpack build with custom visual effects matching dark electronic sound",
        "results": "immersive site with dynamic signal effects creating atmospheric experience. successfully deployed capturing dystopian aesthetic",
        "impact": "demonstrates ability to create experiential web interfaces that align with artistic vision"
      },
      "live_url": "https://signal23.net/"
    }
  ],
  "projects": [
    {
      "id": "logue-osc",
      "title": "logue osc",
      "category": "tools",
      "year": "2025",
      "summary": "place to hold my minilogue xd oscillator",
      "full_description": "Place to hold my minilogue xd oscillator",
      "tech": [
        "javascript",
        "c",
        "makefile",
        "korg logue sdk",
        "web audio api"
      ],
      "github_url": "https://github.com/Glenn-Harless/logue_osc",
      "is_private": false
    },
    {
      "id": "music-rip",
      "title": "music rip",
      "category": "tools",
      "year": "2025",
      "summary": "youtube audio downloader with cli interface",
      "full_description": "YouTube audio downloader with CLI interface",
      "tech": [
        "python",
        "shell",
        "yt-dlp",
        "click",
        "poetry"
      ],
      "github_url": "https://github.com/Glenn-Harless/music_rip",
      "is_private": false
    }
  ]
}