{
  "featured": [
    {
      "id": "psych-ward-optimization",
      "title": "psych ward room optimization",
      "category": "analytics",
      "year": "2025",
      "summary": "inpatient psych ward space optimization with linear programming",
      "full_description": "Inpatient psych ward space optimization using linear programming",
      "tech": [
        "python",
        "pulp",
        "matplotlib",
        "seaborn",
        "pandas"
      ],
      "github_url": "https://github.com/Glenn-Harless/Psych-Ward-Room-Optimization",
      "is_private": false,
      "highlight": "Presented at APA Conference",
      "expanded_content": {
        "problem": "optimizing room assignments in a 26-bed psychiatric facility while balancing patient acuity levels, staff resources, and safety constraints",
        "approach": "linear programming with pulp library. modeled complex constraints including patients deemed unsafe for others or themselves requiring their own room, other patients could double in a room",
        "results": "achieved 99.99% bed utilization efficiency through optimal configuration of 10 single rooms and 8 double rooms (vs current all-double configuration), reducing bed waste from 52 to just 2 beds over 4-month test period while maintaining patient safety requirements",
        "impact": "presented at apa conference. adopted by original facilities. demonstrates practical application of operations research in healthcare"
      }
    },
    {
      "id": "geo-causal-inference",
      "title": "geo causal inference",
      "category": "research",
      "year": "2025",
      "summary": "measuring causal effects of marketing interventions with time-based regression (tbr) with matched...",
      "full_description": "Measuring causal effects of marketing interventions using Time-Based Regression (TBR) with Matched Markets methodology",
      "tech": [
        "python",
        "causal inference",
        "time series",
        "statistical modeling",
        "jupyter notebook"
      ],
      "github_url": null,
      "is_private": true,
      "expanded_content": {
        "problem": "measuring true causal effects of marketing interventions when randomized direct experiments aren't feasible",
        "approach": "time-based regression with matched markets methodology. leverages geographic variation as natural experiments",
        "results": "identified promising geo regions for TV ad implementation and enabled confident impact assessment",
        "impact": "enables data-driven marketing decisions with rigorous statistical backing"
      }
    },
    {
      "id": "sd-civic-data",
      "title": "sd civic data",
      "category": "civic-data",
      "year": "2026",
      "summary": "7-project civic data platform covering san diego's budget, services, housing, transportation, cli...",
      "full_description": "7-project civic data platform covering San Diego's budget, services, housing, transportation, climate, public safety, and homelessness — each with pipeline, Streamlit dashboard, FastAPI, and MCP server",
      "tech": [
        "python",
        "duckdb",
        "streamlit",
        "fastapi",
        "fastmcp"
      ],
      "github_url": null,
      "is_private": false,
      "highlight": "7 dashboards × 75 endpoints × 7 MCP servers",
      "expanded_content": {
        "problem": "san diego publishes open data across dozens of portals but nobody connects the dots — budget to services to housing to safety. residents can't trace how tax dollars flow into outcomes",
        "approach": "built 7 interconnected projects on a shared architecture: duckdb + parquet pipeline → streamlit dashboard → fastapi rest api → mcp server for claude. each project answers questions the previous one raises. monthly github actions refresh keeps data current",
        "results": "75 api endpoints, 7 interactive dashboards, 7 mcp servers. covers 311 service requests (3M+ records), city budget (FY2011-2026), housing permits (2002-present), traffic & transit, climate action, public safety, and homelessness",
        "impact": "a connected story about how the city spends, serves, grows, and evolves — all from open public data. live dashboards: <a href=\"https://sd-get-it-done.streamlit.app/\" target=\"_blank\">311 services</a> · <a href=\"https://sd-city-budget-live.streamlit.app/\" target=\"_blank\">city budget</a> · <a href=\"https://sd-housing-permits.streamlit.app/\" target=\"_blank\">housing permits</a> · <a href=\"https://sd-traffic-transportation.streamlit.app/\" target=\"_blank\">traffic & transit</a> · <a href=\"https://sd-climate-action.streamlit.app/\" target=\"_blank\">climate action</a> · <a href=\"https://sd-public-safety.streamlit.app/\" target=\"_blank\">public safety</a> · <a href=\"https://sd-homelessness.streamlit.app/\" target=\"_blank\">homelessness</a>"
      }
    },
    {
      "id": "content-pulse",
      "title": "content pulse",
      "category": "ai-ml",
      "year": "2024",
      "summary": "llm-powered content aggregator and analyzer for extracting real-time insights from social media a...",
      "full_description": "LLM-powered content aggregator and analyzer for extracting real-time insights from social media and news sources",
      "tech": [
        "python",
        "fastapi",
        "beautifulsoup4",
        "uvicorn",
        "ollama"
      ],
      "github_url": "https://github.com/Glenn-Harless/content-pulse",
      "is_private": false,
      "expanded_content": {
        "problem": "crypto market moves faster than human analysis can track. signal often buried in social media noise",
        "approach": "real-time ingestion from multiple sources. llm-powered sentiment extraction and trend identification",
        "results": "personal tool for scraping multiple news outlets in the morning",
        "impact": "provides traders with early market intelligence through automated analysis"
      }
    },
    {
      "id": "econdash",
      "title": "econdash",
      "category": "engineering",
      "year": "2024",
      "summary": "airflow and postgresql data pipeline for bea economic data",
      "full_description": "Airflow and PostgreSQL data pipeline for BEA economic data",
      "tech": [
        "python",
        "apache airflow",
        "postgresql",
        "docker",
        "redis"
      ],
      "github_url": "https://github.com/Glenn-Harless/EconDash",
      "is_private": false,
      "expanded_content": {
        "problem": "economic data scattered across federal agencies. manual collection error-prone and time-consuming",
        "approach": "airflow orchestration with bea api integration. postgresql storage with dbt transformations",
        "results": "automated daily updates of 50+ economic indicators. 99.9% pipeline reliability",
        "impact": "enables real-time economic analysis with production-grade infrastructure"
      }
    },
    {
      "id": "ethoscope",
      "title": "ethoscope",
      "category": "engineering",
      "year": "2025",
      "summary": "comprehensive ethereum network monitoring platform tracking gas prices, mev activity, and l2 migr...",
      "full_description": "Comprehensive Ethereum network monitoring platform tracking gas prices, MEV activity, and L2 migration patterns with real-time ETL pipeline and predictive analytics",
      "tech": [
        "python",
        "fastapi",
        "timescaledb",
        "prophet",
        "scikit-learn"
      ],
      "github_url": "https://github.com/Glenn-Harless/ethoscope",
      "is_private": false,
      "expanded_content": {
        "problem": "ethereum network health monitoring requires real-time analysis of gas prices, mev activity, and l2 migration patterns across fragmented data sources",
        "approach": "real-time etl pipeline with web3.py and alchemy api. timescaledb for efficient time-series storage. prophet and scikit-learn for predictive analytics",
        "results": "automated collection of blockchain metrics with reliable data ingestion. comprehensive historical data storage for trend analysis",
        "impact": "personal tool for understanding ethereum metrics and gaining hands-on experience in the web3 space"
      }
    },
    {
      "id": "ope-base",
      "title": "ope base",
      "category": "analytics",
      "year": "2024",
      "summary": "analytics platform for tracking music artist engagement across twitter, instagram, and reddit. im...",
      "full_description": "Analytics platform for tracking music artist engagement across Twitter, Instagram, and Reddit. Implements bot detection with Isolation Forest, clustering for user segmentation, and trend analysis to optimize content strategy",
      "tech": [
        "jupyter notebook",
        "python",
        "docker",
        "postgresql",
        "metabase"
      ],
      "github_url": "https://github.com/Glenn-Harless/ope_base",
      "is_private": false,
      "expanded_content": {
        "problem": "music artists lack data-driven insights for content strategy. engagement patterns obscured by bots and noise",
        "approach": "multi-year social media tracking with ml analysis. isolation forest for bot detection, clustering for audience segmentation",
        "results": "identified optimal posting times, content types, and audience segments. detected 15-20% bot activity in engagement metrics",
        "impact": "enabled data-driven content strategy for independent artists. insights applicable across music industry"
      }
    },
    {
      "id": "arcope-website",
      "title": "arcope website",
      "category": "web",
      "year": "2025",
      "summary": "interactive website for solo electronic project arcope featuring network/data aesthetics inspired...",
      "full_description": "Interactive website for solo electronic project Arcope featuring network/data aesthetics inspired by Odesza",
      "tech": [
        "typescript",
        "react",
        "framer motion",
        "vite",
        "tailwind css"
      ],
      "github_url": "https://github.com/Glenn-Harless/arcope-website",
      "is_private": false,
      "highlight": "Live at arcope.xyz",
      "expanded_content": {
        "problem": "solo electronic music project needed web presence reflecting odesza-inspired sound and data/network aesthetics",
        "approach": "react with framer motion animations. vibe-coded frontend exploring creative web development outside backend comfort zone",
        "results": "interactive site with network-inspired visuals matching the musical aesthetic. deployed on netlify with docker dev environment",
        "impact": "demonstrates versatility beyond backend/data work. shows willingness to learn and experiment with new domains"
      },
      "live_url": "http://arcope.xyz/"
    },
    {
      "id": "lost-in-tropez-website",
      "title": "lost in tropez website",
      "category": "web",
      "year": "2025",
      "summary": "vibrant website for electronic dance duo lost in tropez with retro psychedelic aesthetics inspire...",
      "full_description": "Vibrant website for electronic dance duo Lost in Tropez with retro psychedelic aesthetics inspired by Polo & Pan",
      "tech": [
        "typescript",
        "react",
        "vite",
        "tailwind css",
        "docker"
      ],
      "github_url": "https://github.com/Glenn-Harless/lost-in-tropez-website",
      "is_private": false,
      "highlight": "Live at lostintropez.xyz",
      "expanded_content": {
        "problem": "electronic dance duo inspired by polo & pan needed vibrant web presence with retro psychedelic aesthetics",
        "approach": "typescript react with vite build system. embraced experimental frontend development to match group's playful energy",
        "results": "colorful, animated site capturing the duo's tropical electronic vibe. containerized development for consistent environments",
        "impact": "showcases creative side and ability to translate musical aesthetics into visual web experiences"
      },
      "live_url": "https://lostintropez.xyz/"
    },
    {
      "id": "signal-23-website",
      "title": "signal 23 website",
      "category": "web",
      "year": "2025",
      "summary": "interactive website for electronic duo signal-23 featuring dystopian noise effects and data/numbe...",
      "full_description": "Interactive website for electronic duo Signal-23 featuring dystopian noise effects and data/numbers station aesthetics",
      "tech": [
        "react",
        "javascript",
        "webpack",
        "tailwind css",
        "docker"
      ],
      "github_url": "https://github.com/Glenn-Harless/signal-23-website",
      "is_private": false,
      "highlight": "Live at signal23.net",
      "expanded_content": {
        "problem": "electronic duo exploring moderat-inspired themes needed dystopian web presence reflecting data/numbers station aesthetics",
        "approach": "react with interactive noise effects and signal animations. webpack build with custom visual effects matching dark electronic sound",
        "results": "immersive site with dynamic signal effects creating atmospheric experience. successfully deployed capturing dystopian aesthetic",
        "impact": "demonstrates ability to create experiential web interfaces that align with artistic vision"
      },
      "live_url": "https://signal23.net/"
    }
  ],
  "projects": [
    {
      "id": "racksmith",
      "title": "racksmith",
      "category": "tools",
      "year": "2026",
      "summary": "cli tool to programmatically generate ableton live audio effect racks (.adg files) from simple co...",
      "full_description": "CLI tool to programmatically generate Ableton Live audio effect racks (.adg files) from simple commands or AI-assisted prompts",
      "tech": [
        "python",
        "xml parsing",
        "click",
        "uv",
        "llm integration"
      ],
      "github_url": null,
      "is_private": true,
      "expanded_content": {
        "problem": "building effect chains in ableton is tedious menu-clicking when you'd rather be making music. push 3 standalone makes this even more painful",
        "approach": "reverse-engineered .adg format (gzip-compressed xml). built template extraction from real racks, chain syntax parser, macro mapping system, and ai-assisted generation via llm prompts",
        "results": "generate complex racks in seconds with simple commands like 'eq8 -> compressor -> reverb'. supports parameter defaults, macro mappings with custom ranges, and switchable variations",
        "impact": "personal productivity tool that lets me focus on sound design instead of clicking through menus. demonstrates intersection of data engineering patterns and creative workflows"
      }
    },
    {
      "id": "mfc",
      "title": "mfc",
      "category": "tools",
      "year": "2026",
      "summary": "cli tool for programmatically authoring arturia minifreak synthesizer presets from config files",
      "full_description": "CLI tool for programmatically authoring Arturia MiniFreak synthesizer presets from config files",
      "tech": [
        "python",
        "toml",
        "typer",
        "uv"
      ],
      "github_url": null,
      "is_private": true,
      "expanded_content": {
        "problem": "creating and managing presets for the arturia minifreak is slow and manual. the hardware editor is fine for tweaking but terrible for batch creation or systematic preset design",
        "approach": "python cli that reads and writes minifreak preset files. toml-based configuration for defining oscillator types, filter settings, and modulation routing. template system for rapid iteration",
        "results": "programmatic preset generation from config files. batch creation of preset variations. systematic exploration of the minifreak's sound engine",
        "impact": "another music tool that automates the tedious parts of sound design. same pattern as racksmith but for hardware synth presets"
      }
    },
    {
      "id": "mxd",
      "title": "mxd",
      "category": "tools",
      "year": "2026",
      "summary": "cli tool and wasm preview app for building korg minilogue xd user oscillators with browser-based ...",
      "full_description": "CLI tool and WASM preview app for building Korg Minilogue XD user oscillators with browser-based testing",
      "tech": [
        "python",
        "typer",
        "c",
        "emscripten",
        "docker"
      ],
      "github_url": null,
      "is_private": true,
      "expanded_content": {
        "problem": "developing custom oscillators for the korg minilogue xd requires wrestling with the logue sdk toolchain, cross-compiling for arm, and no way to preview without loading onto hardware",
        "approach": "python cli wrapping the full logue sdk workflow. emscripten/wasm compilation for browser-based oscillator preview. docker builds for consistent cross-compilation. typer for ergonomic cli",
        "results": "full dev cycle from 'mxd init' to hardware binary. browser preview eliminates the upload-test-repeat loop. preset system for testing different parameter combinations",
        "impact": "evolved from basic logue_osc experiments into a proper development toolkit. bridges embedded c programming with modern python developer experience"
      }
    },
    {
      "id": "date-night",
      "title": "date night",
      "category": "web",
      "year": "2026",
      "summary": "full-stack san diego date planning app for indecisive with smart filtering and suggestions",
      "full_description": "Full-stack San Diego date planning app for the indecisive with smart filtering and suggestions",
      "tech": [
        "next.js",
        "typescript",
        "fastapi",
        "postgresql",
        "docker"
      ],
      "github_url": "https://github.com/Glenn-Harless/date_night",
      "is_private": false,
      "expanded_content": {
        "problem": "deciding what to do on a date night in san diego always ends in analysis paralysis. too many options, no way to filter or plan efficiently",
        "approach": "full-stack web app with next.js frontend and fastapi backend. radix ui components with framer motion animations. postgresql database with sqlalchemy async orm. deployed on render",
        "results": "date planning app with smart filtering, suggestions, and a polished ui. mobile-friendly with animated interactions",
        "impact": "fun personal project that solves a real problem. first full-stack app with next.js frontend and python backend working together"
      }
    },
    {
      "id": "stitch-chords",
      "title": "stitch chords",
      "category": "tools",
      "year": "2026",
      "summary": "high-density music theory reference pwa for keyboard players with artist harmonic mapping and cho...",
      "full_description": "High-density music theory reference PWA for keyboard players with artist harmonic mapping and chord expansion engine",
      "tech": [
        "react",
        "typescript",
        "vite",
        "tailwind css",
        "pwa"
      ],
      "github_url": "https://github.com/Glenn-Harless/stitch_chords",
      "is_private": false,
      "expanded_content": {
        "problem": "learning complex chord voicings and artist-specific harmonic techniques means jumping between scattered music theory resources. no single reference optimized for keyboard players",
        "approach": "react pwa with terminal-inspired aesthetic. music theory engine that parses chord symbols into intervals and note spellings. artist harmonic libraries with roman numeral analysis",
        "results": "high-density reference app with artist chord maps (radiohead, apparat, nils frahm), harmonic expansion engine, live transpose, and song builder. works offline as pwa",
        "impact": "bridges music theory and engineering. demonstrates ability to build domain-specific tools with complex internal logic"
      }
    },
    {
      "id": "music-rip",
      "title": "music rip",
      "category": "tools",
      "year": "2025",
      "summary": "cli tool for downloading and organizing audio from youtube for sampling and dj sets",
      "full_description": "CLI tool for downloading and organizing audio from YouTube for sampling and DJ sets",
      "tech": [
        "python",
        "yt-dlp",
        "click",
        "poetry",
        "ffmpeg"
      ],
      "github_url": "https://github.com/Glenn-Harless/music_rip",
      "is_private": false,
      "expanded_content": {
        "problem": "finding and downloading samples or tracks for dj sets involves too many clicks and manual file management. needed a streamlined workflow",
        "approach": "python cli wrapping yt-dlp with sensible defaults for audio quality, automatic metadata tagging, and organized output directories. poetry for dependency management",
        "results": "one command to download, convert, and organize audio files. integrates into music production workflow seamlessly",
        "impact": "simple utility that saves time in the creative process. example of building small tools to solve personal friction points"
      }
    }
  ]
}